Revit 2027 API
NurbsSurfaceData.DegreeU Property
 The degree of the spline in the u-direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int DegreeU { get; }
Public ReadOnly Property DegreeU As Integer
	Get
public:
property int DegreeU {
	int get ();
}
member DegreeU : int with get
Property Value
Int32
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace